// Validation errors messages for Parsley
// Load this after Parsley

Parsley.addMessages('ar', {
    defaultMessage: "طھط£ظƒط¯ ظ…ظ† طµط­ط© ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„",
    type: {
      email:        "طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط¨ط±ظٹط¯ ط§ظ„ظƒطھط±ظˆظ†ظٹ طµط­ظٹط­",
      url:          "طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط±ط§ط¨ط· طµط­ظٹط­",
      number:       "طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط±ظ‚ظ…",
      integer:      "طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط¹ط¯ط¯ طµط­ظٹط­ ط¨ط¯ظˆظ† ظƒط³ظˆط±",
      digits:       "طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط±ظ‚ظ…",
      alphanum:     "طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط­ط±ظˆظپ ظˆط£ط±ظ‚ط§ظ… ظپظ‚ط·"
    },
    notblank:       "طھط£ظƒط¯ ظ…ظ† طھط¹ط¨ط¦ط© ط§ظ„ط­ظ‚ظ„",
    required:       "ظ‡ط°ط§ ط§ظ„ط­ظ‚ظ„ ظ…ط·ظ„ظˆط¨",
    pattern:        "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ط؛ظٹط± طµط­ظٹط­ط©",
    min:            "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ظٹط¬ط¨ ط£ظ† طھظƒظˆظ† ط£ظƒط¨ط± ظ…ظ† %s.",
    max:            "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ظٹط¬ط¨ ط£ظ† طھظƒظˆظ† ط£طµط؛ط± ظ…ظ† %s.",
    range:          "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ظٹط¬ط¨ ط£ظ† طھظƒظˆظ† ط¨ظٹظ† %s ظˆ %s.",
    minlength:      "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ظ‚طµظٹط±ط© ط¬ط¯ط§ظ‹ . طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ %s ط­ط±ظپ ط£ظˆ ط£ظƒط«ط±",
    maxlength:      "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ط·ظˆظٹظ„ط© . طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ %s ط­ط±ظپ ط£ظˆ ط£ظ‚ظ„",
    length:         "ط§ظ„ظ‚ظٹظ…ط© ط§ظ„ظ…ط¯ط®ظ„ط© ط؛ظٹط± طµط­ظٹط­ط©. طھط£ظƒط¯ ظ…ظ† ط¥ط¯ط®ط§ظ„ ط¨ظٹظ†  %s ظˆ %s ط®ط§ظ†ط©",
    mincheck:       "ظٹط¬ط¨ ط§ط®طھظٹط§ط± %s ط®ظٹط§ط± ط¹ظ„ظ‰ ط§ظ„ط£ظ‚ظ„.",
    maxcheck:       "ظٹط¬ط¨ ط§ط®طھظٹط§ط±%s ط®ظٹط§ط± ط£ظˆ ط£ظ‚ظ„",
    check:          "ظٹط¬ط¨ ط§ط®طھظٹط§ط± ط¨ظٹظ† %s ظˆ %s ط®ظٹط§ط±.",
    equalto:        "طھط£ظƒط¯ ظ…ظ† طھط·ط§ط¨ظ‚ ط§ظ„ظ‚ظٹظ…طھظٹظ† ط§ظ„ظ…ط¯ط®ظ„ط©."
  });
  
  Parsley.setLocale('ar');
  